In [1]:
import pandas as pd
import sqlite3

def sql_query(query):
    c = cur.execute(query)
    df = pd.DataFrame(c.fetchall(), 
                      columns=[description[0] for description in c.description])
    return df

### State of the UNION

In [2]:
conn = sqlite3.connect('leaders.sqlite')
cur = conn.cursor()

In [3]:
sql_query('''SELECT prime_minister as leader, country
FROM prime_ministers
UNION
SELECT monarch, country
FROM monarchs
ORDER BY country;''')

                     leader    country
0          Malcolm Turnbull  Australia
1          Hassanal Bolkiah     Brunei
2             Sherif Ismail      Egypt
3        Jack Guy Lafontant      Haiti
4             Narendra Modi      India
5              Erna Solberg     Norway
6                  Harald V     Norway
7   Qaboos bin Said al Said       Oman
8             Antonio Costa   Portugal
9                 Felipe VI      Spain
10            Mariano Rajoy      Spain
11         Nguyen Xuan Phuc    Vietnam

In [4]:
sql_query('''SELECT prime_minister as leader, country
FROM prime_ministers
UNION ALL
SELECT monarch, country
FROM monarchs
ORDER BY country;''')

                     leader    country
0          Malcolm Turnbull  Australia
1          Hassanal Bolkiah     Brunei
2          Hassanal Bolkiah     Brunei
3             Sherif Ismail      Egypt
4        Jack Guy Lafontant      Haiti
5             Narendra Modi      India
6              Erna Solberg     Norway
7                  Harald V     Norway
8   Qaboos bin Said al Said       Oman
9   Qaboos bin Said al Said       Oman
10            Antonio Costa   Portugal
11            Mariano Rajoy      Spain
12                Felipe VI      Spain
13         Nguyen Xuan Phuc    Vietnam

In [5]:
conn.close()

In [6]:
conn = sqlite3.connect('countries.sqlite')
cur = conn.cursor()

In [7]:
sql_query('''-- Select fields from 2010 table
SELECT *
  -- From 2010 table
  FROM economies2010
	-- Set theory clause
	UNION
-- Select fields from 2015 table
SELECT * 
  -- From 2015 table
  FROM economies2015
-- Order by code and year
ORDER BY code, year;''').head(3)

  code  year         income_group  gross_savings
0  AFG  2010           Low income         37.133
1  AFG  2015           Low income         21.466
2  AGO  2010  Upper middle income         23.534

In [8]:
len(sql_query('''-- Select field
SELECT country_code
  -- From cities
  FROM cities 
	-- Set theory clause
	UNION
-- Select field
SELECT code 
  -- From currencies
  FROM currencies 
-- Order by country_code
ORDER BY country_code;'''))

205

In [9]:
len(sql_query('''-- Select fields
SELECT code, year
  -- From economies
  FROM economies
	-- Set theory clause
	UNION ALL 
-- Select fields
SELECT country_code, year  
  -- From populations
  FROM populations
-- Order by code, year
ORDER BY code, year;'''))

814

In [10]:
conn.close()

In [11]:
conn = sqlite3.connect('leaders.sqlite')
cur = conn.cursor()

In [12]:
sql_query('''SELECT country
FROM prime_ministers
INTERSECT
SELECT country
FROM presidents;''')

    country
0     Egypt
1     Haiti
2  Portugal
3   Vietnam

In [13]:
sql_query('''SELECT country, prime_minister AS leader
FROM prime_ministers
INTERSECT
SELECT country, president
FROM presidents;''')

Empty DataFrame
Columns: [country, leader]
Index: []

In [14]:
conn.close()

In [15]:
conn = sqlite3.connect('countries.sqlite')
cur = conn.cursor()

In [16]:
len(sql_query('''-- Select fields
SELECT code, year 
  -- From economies
  FROM economies
	-- Set theory clause
	INTERSECT
-- Select fields
SELECT country_code, year 
  -- From populations
FROM populations
-- Order by code and year
ORDER BY code, year;'''))

380

In [17]:
sql_query('''-- Select fields
SELECT country_name 
  -- From countries
  FROM countries 
	-- Set theory clause
	INTERSECT
-- Select fields
SELECT name 
  -- From cities
  FROM cities;''')

  country_name
0    Hong Kong
1    Singapore

In [18]:
conn.close()

In [19]:
conn = sqlite3.connect('leaders.sqlite')
cur = conn.cursor()

In [20]:
sql_query('''SELECT monarch, country
FROM monarchs
EXCEPT
SELECT prime_minister, country
FROM prime_ministers''')

     monarch country
0  Felipe VI   Spain
1   Harald V  Norway

In [21]:
conn.close()

In [22]:
conn = sqlite3.connect('countries.sqlite')
cur =  conn.cursor()

In [23]:
sql_query('''-- Select field
SELECT name
  -- From cities
  FROM cities
	-- Set theory clause
	EXCEPT
-- Select field
SELECT capital
  -- From countries
  FROM countries
-- Order by result
ORDER BY name;
''')

               name
0           Abidjan
1         Ahmedabad
2        Alexandria
3            Almaty
4          Auckland
5           Bandung
6         Barcelona
7      Barranquilla
8             Basra
9    Belo Horizonte
10        Bengaluru
11           Bhopal
12       Birmingham
13         Brisbane
14        Bucharest
15            Busan
16          Calgary
17             Cali
18         Caloocan
19         Campinas
20        Cape Town
21       Casablanca
22        Changchun
23         Changsha
24         Chaozhou
25          Chengdu
26          Chennai
27          Chicago
28       Chittagong
29        Chongqing
..              ...
140         Shantou
141        Shenyang
142        Shenzhen
143    Shijiazhuang
144          Shiraz
145        Surabaya
146           Surat
147          Suzhou
148        T'bilisi
149          Tabriz
150        Taichung
151          Tainan
152          Taipei
153        Tangshan
154         Tianjin
155         Tijuana
156         Toronto
157           Ulsan
158      Vijayawada
159   Visakhapatnam
160         Wenzhou
161           Wuhan
162           Xi'an
163          Xiamen
164          Yangon
165   Yekaterinburg
166        Yokohama
167       Zhengzhou
168       Zhongshan
169           Zunyi

[170 rows x 1 columns]

In [24]:
conn.close()

In [25]:
conn = sqlite3.connect('leaders.sqlite')
cur = conn.cursor()

In [26]:
sql_query('''SELECT name 
FROM states
WHERE indep_year < 1800;''')

       name
0  Portugal
1     Spain

In [27]:
sql_query('''SELECT president, country, continent
FROM presidents
WHERE country IN
	(SELECT name
	FROM states 
	WHERE indep_year < 1800);''')

                 president   country continent
0  Marcelo Rebelo de Sousa  Portugal    Europe

In [28]:
conn.close()

In [29]:
conn = sqlite3.connect('countries.sqlite')
cur = conn.cursor()

In [30]:
sql_query('''-- Select code
SELECT code
  -- From countries
  FROM countries
-- Where region is Middle East
WHERE region = 'Middle East';''')

   code
0   ARE
1   ARM
2   AZE
3   BHR
4   GEO
5   IRQ
6   ISR
7   YEM
8   JOR
9   KWT
10  CYP
11  LBN
12  OMN
13  QAT
14  SAU
15  SYR
16  TUR
17  PSE

In [31]:
sql_query('''-- Select field
SELECT DISTINCT name 
  -- From languages
  FROM languages
-- Order by name
ORDER BY name;
''')

                name
0               Afar
1          Afrikaans
2              Akyem
3           Albanian
4           Alsatian
5         Amerindian
6            Amharic
7            Angolar
8    Antiguan creole
9             Arabic
10           Aramaic
11           Aranese
12          Armenian
13            Asante
14         Ashaninka
15             Asian
16          Assamese
17            Avadhi
18            Aymara
19       Azerbaijani
20             Azeri
21            Bahasa
22   Bahasa Malaysia
23             Bajan
24           Bajjika
25           Balochi
26           Baluchi
27           Bambara
28          Bandjabi
29            Bangla
..               ...
366            Uzbek
367            Venda
368       Vietnamese
369        Wallisian
370         Wolaytta
371         Woleaian
372            Wolof
373               Wu
374            Xhosa
375            Xiang
376       Xichangana
377         Xitsonga
378           Yapese
379           Yoruba
380              Yue
381           Zezuru
382             Zulu
383              and
384          foreign
385       government
386       indigenous
387       isiNdebele
388             many
389     multilingual
390             none
391          siSwati
392             sign
393           tribal
394          unknown
395      unspecified

[396 rows x 1 columns]

In [32]:
sql_query('''SELECT DISTINCT name 
  FROM languages
WHERE code IN (
SELECT code
  FROM countries
WHERE region = 'Middle East')
ORDER BY name;''')

           name
0        Arabic
1       Aramaic
2      Armenian
3   Azerbaijani
4         Azeri
5       Baluchi
6     Bulgarian
7    Circassian
8       English
9         Farsi
10     Filipino
11       French
12     Georgian
13        Greek
14       Hebrew
15        Hindi
16       Indian
17      Kurdish
18        Other
19      Persian
20     Romanian
21      Russian
22       Syriac
23      Turkish
24      Turkmen
25         Urdu
26  unspecified

In [33]:
conn.close()

In [34]:
conn = sqlite3.connect('countries.sqlite')
cur = conn.cursor()

In [37]:
sql_query('''
-- Select statement
SELECT COUNT(*)
  -- From countries
  FROM countries
-- Where continent is Oceania
WHERE continent = 'Oceania';''')

   COUNT(*)
0        19

In [38]:
sql_query('''-- 5. Select fields (with aliases)
SELECT c1.code, c1.country_name, c2.basic_unit AS currency 
  -- 1. From countries (alias as c1)
  FROM countries AS c1
  	-- 2. Join with currencies (alias as c2)
  	INNER JOIN currencies AS c2
    -- 3. Match on code
    ON c1.code = c2.code
-- 4. Where continent is Oceania
WHERE continent = 'Oceania';''')

   code      country_name                currency
0   AUS         Australia       Australian dollar
1   KIR          Kiribati       Australian dollar
2   MHL  Marshall Islands    United States dollar
3   NRU             Nauru       Australian dollar
4   PLW             Palau    United States dollar
5   PNG  Papua New Guinea  Papua New Guinean kina
6   PYF  French Polynesia               CFP franc
7   SLB   Solomon Islands  Solomon Islands dollar
8   WSM             Samoa             Samoan tala
9   TON             Tonga          Tongan paʻanga
10  TUV            Tuvalu       Australian dollar
11  TUV            Tuvalu         Tuvaluan dollar
12  NCL     New Caledonia               CFP franc
13  NZL       New Zealand      New Zealand dollar
14  VUT           Vanuatu            Vanuatu vatu